### Parte 6

In [30]:
## Tratamento de dados faltantes

In [31]:
import pandas as pd

In [32]:
dados = pd.read_csv("aluguel_residencial.csv", sep=";")
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
5,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,0.0,0.0
6,Casa de Condomínio,Ramos,2,2,0,65,1000.0,0.0,0.0
7,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0
8,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0
9,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0

In [33]:
dados.isnull() ## se o dado no dataframe for null ele marca como true

        Tipo  Bairro  Quartos  Vagas  Suites   Area  Valor  Condominio   IPTU
0      False   False    False  False   False  False  False       False  False
1      False   False    False  False   False  False  False       False  False
2      False   False    False  False   False  False  False       False  False
3      False   False    False  False   False  False  False       False  False
4      False   False    False  False   False  False  False       False  False
...      ...     ...      ...    ...     ...    ...    ...         ...    ...
22364  False   False    False  False   False  False  False       False  False
22365  False   False    False  False   False  False  False       False  False
22366  False   False    False  False   False  False  False       False  False
22367  False   False    False  False   False  False  False       False  False
22368  False   False    False  False   False  False  False       False  False

[22369 rows x 9 columns]

In [34]:
dados.notnull() ## contrário do isnull(), ou seja, marca false se a informação for null

       Tipo  Bairro  Quartos  Vagas  Suites  Area  Valor  Condominio  IPTU
0      True    True     True   True    True  True   True        True  True
1      True    True     True   True    True  True   True        True  True
2      True    True     True   True    True  True   True        True  True
3      True    True     True   True    True  True   True        True  True
4      True    True     True   True    True  True   True        True  True
...     ...     ...      ...    ...     ...   ...    ...         ...   ...
22364  True    True     True   True    True  True   True        True  True
22365  True    True     True   True    True  True   True        True  True
22366  True    True     True   True    True  True   True        True  True
22367  True    True     True   True    True  True   True        True  True
22368  True    True     True   True    True  True   True        True  True

[22369 rows x 9 columns]

In [35]:
dados.info()
# note que é possível perceber que as variaveis valor, condominio, sobretudo, o IPTU contém valores nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22369 entries, 0 to 22368
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22369 non-null  object
 1   Bairro      22369 non-null  object
 2   Quartos     22369 non-null  int64
 3   Vagas       22369 non-null  int64
 4   Suites      22369 non-null  int64
 5   Area        22369 non-null  int64
 6   Valor       22369 non-null  float64
 7   Condominio  22369 non-null  float64
 8   IPTU        22369 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.5+ MB

In [36]:
dados[dados['Valor'].isnull()]
# mostrando o dataFrame em que o campo valor é nulo

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

In [37]:
## testando o metodo dropna para eliminar as tuplas que contem o campo valor null
dados.dropna(subset=['Valor'], inplace=True)
## o attr subset recebe uma lista dos valores (colunas) que vão ser verificadas para remoção
dados[dados['Valor'].isnull()] # constatando que os valores foram removidos

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

In [38]:
dados[dados['Condominio'].isnull()].shape[0]

0

In [39]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())

In [40]:
dados = dados[~selecao] # o operador ~ na frente de uma var/series booleana inverte o valor
dados[dados['Condominio'].isnull()].shape[0]

0

In [41]:
## preenchendo os valores NaN
dados = dados.fillna({'Condominio': 0, 'IPTU': 0})
dados[dados['Condominio'].isnull()].shape[0]
## o método fillna() aceita o param inplace. Não foi utilizado para mostrar que é possível
## passar um dicionário para personalizar a substituição de cada variável específica

0

In [42]:
dados.info() # mostrando que não temos mais valores nulos na nossa base

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22369 entries, 0 to 22368
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22369 non-null  object
 1   Bairro      22369 non-null  object
 2   Quartos     22369 non-null  int64
 3   Vagas       22369 non-null  int64
 4   Suites      22369 non-null  int64
 5   Area        22369 non-null  int64
 6   Valor       22369 non-null  float64
 7   Condominio  22369 non-null  float64
 8   IPTU        22369 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [43]:
dados.to_csv("aluguel_residencial.csv", sep=";", index=False)
# atualizando a base

#### Extra

In [44]:
## métodos de interpolação

In [45]:
data = [0.5, None, None, 0.52, None, None, 0.59, 0.6, None, 0.7]
s = pd.Series(data)
s

0    0.50
1     NaN
2     NaN
3    0.52
4     NaN
5     NaN
6    0.59
7    0.60
8     NaN
9    0.70
dtype: float64

In [46]:
s.fillna(0) # substituição simples

0    0.50
1    0.00
2    0.00
3    0.52
4    0.00
5    0.00
6    0.59
7    0.60
8    0.00
9    0.70
dtype: float64

In [47]:
s.fillna(method='ffill')
# o metodo ffill preenche o valor nulo com o valor anterior de cima para baixo

0    0.50
1    0.50
2    0.50
3    0.52
4    0.52
5    0.52
6    0.59
7    0.60
8    0.60
9    0.70
dtype: float64

In [48]:
s.fillna(method='bfill')
## o metodo bfill é o oposto do ffill. Preenche o valor nulo com o valor anterior de baixo para cima

0    0.50
1    0.52
2    0.52
3    0.52
4    0.59
5    0.59
6    0.59
7    0.60
8    0.70
9    0.70
dtype: float64

In [49]:
s.fillna(s.mean())
# é possível preencher os valores nulos com a média dos n nulos

0    0.500
1    0.582
2    0.582
3    0.520
4    0.582
5    0.582
6    0.590
7    0.600
8    0.582
9    0.700
dtype: float64

In [51]:
s.fillna(method='ffill', limit=1)
# estabelecendo o limite para o preenchimento, ou seja, ele só preencheu o primeiro valor NaN por exemplo

0    0.50
1    0.50
2     NaN
3    0.52
4    0.52
5     NaN
6    0.59
7    0.60
8    0.60
9    0.70
dtype: float64

### Parte 7